Repository: Deb-Dev/Journaling
Catalog: Journaling/Resources/*.lproj/Localizable.strings
Languages: es

# general.ok
source: OK
es: Aceptar

# general.cancel
source: Cancel
es: Cancelar

# general.back
source: Back
es: Atrás

# general.next
source: Next
es: Siguiente

# general.done
source: Done
es: Listo

# general.save
source: Save
es: Guardar

# general.loading
source: Loading...
es: Cargando...

# general.error.network
source: Network error. Please check your connection.
es: Error de red. Por favor, verifica tu conexión.

# general.error.unknown
source: An unexpected error occurred.
es: Ocurrió un error inesperado.

# welcome.title
source: Welcome to Reflect
es: Bienvenido a Reflect

# welcome.subtitle
source: Your personal space for thoughts and feelings.
es: Tu espacio personal para pensamientos y sentimientos.

# welcome.feature1.title
source: Capture Moments
es: Captura Momentos

# welcome.feature1.description
source: Easily jot down your daily experiences and reflections.
es: Anota fácilmente tus experiencias y reflexiones diarias.

# welcome.feature2.title
source: Track Your Mood
es: Registra tu estado de ánimo

# welcome.feature2.description
source: Understand your emotional patterns over time.
es: Comprende tus patrones emocionales a lo largo del tiempo.

# welcome.feature3.title
source: Stay Consistent
es: Mantente constante

# welcome.feature3.description
source: Set reminders and build a healthy journaling habit.
es: [es] Set reminders and build a healthy journaling habit.

# welcome.login.button
source: Log In
es: [es] Log In

# welcome.signup.button
source: Sign Up
es: [es] Sign Up

# login.title
source: Log In
es: [es] Log In

# login.email.placeholder
source: Email
es: [es] Email

# login.password.placeholder
source: Password
es: [es] Password

# login.forgotPassword.button
source: Forgot Password?
es: [es] Forgot Password?

# login.button
source: Log In
es: [es] Log In

# login.signup.prompt
source: Don't have an account?
es: [es] Don't have an account?

# login.signup.link
source: Sign up
es: [es] Sign up

# signup.title
source: Create Account
es: [es] Create Account

# signup.name.placeholder
source: Name
es: [es] Name

# signup.email.placeholder
source: Email
es: [es] Email

# signup.password.placeholder
source: Password (min. 6 characters)
es: [es] Password (min. 6 characters)

# signup.button
source: Sign Up
es: [es] Sign Up

# signup.login.prompt
source: Already have an account?
es: [es] Already have an account?

# signup.login.link
source: Log in
es: [es] Log in

# forgotPassword.title
source: Reset Password
es: [es] Reset Password

# forgotPassword.instructions
source: Enter your email address and we'll send you instructions to reset your password.
es: [es] Enter your email address and we'll send you instructions to reset your password.

# forgotPassword.email.placeholder
source: Email
es: [es] Email

# forgotPassword.sendReset.button
source: Send Reset Link
es: [es] Send Reset Link

# forgotPassword.backToLogin.button
source: Back to Login
es: [es] Back to Login

# forgotPassword.success.message
source: Password reset instructions sent to your email.
es: [es] Password reset instructions sent to your email.

# home.title
source: Home
es: [es] Home

# home.recentEntries.title
source: Recent Entries
es: [es] Recent Entries

# home.newEntry.button
source: New Entry
es: [es] New Entry

# home.loading.message
source: Loading entries...
es: [es] Loading entries...

# home.emptyState.title
source: No Entries Yet
es: [es] No Entries Yet

# home.emptyState.message
source: Tap the '+' button to create your first journal entry.
es: [es] Tap the '+' button to create your first journal entry.

# home.createFirstEntry.button
source: Create First Entry
es: [es] Create First Entry

# home.stats.title
source: Your Stats
es: [es] Your Stats

# home.stats.totalEntries
source: Total Entries
es: [es] Total Entries

# home.stats.dayStreak
source: Day Streak
es: [es] Day Streak

# home.stats.commonMood
source: Common Mood
es: [es] Common Mood

# calendar.title
source: Calendar
es: [es] Calendar

# calendar.entries
source: %d Entries
es: [es] %d Entries

# calendar.noEntries.title
source: No Entries
es: [es] No Entries

# calendar.noEntries.message
source: No entries recorded for this date.
es: [es] No entries recorded for this date.

# entryDetail.title
source: Entry Detail
es: [es] Entry Detail

# entryDetail.mood.label
source: Mood
es: [es] Mood

# entryDetail.tags.label
source: Tags
es: [es] Tags

# entryDetail.created
source: Created
es: [es] Created

# entryDetail.edited
source: Edited
es: [es] Edited

# entryDetail.edit
source: Edit
es: [es] Edit

# entryDetail.delete
source: Delete
es: [es] Delete

# entryDetail.options
source: Options
es: [es] Options

# entryDetail.deleteConfirm.title
source: Delete Entry?
es: [es] Delete Entry?

# entryDetail.deleteConfirm.message
source: Are you sure you want to permanently delete this journal entry?
es: [es] Are you sure you want to permanently delete this journal entry?

# general.delete
source: Delete
es: [es] Delete

# editor.title.new
source: New Entry
es: [es] New Entry

# editor.title.edit
source: Edit Entry
es: [es] Edit Entry

# editor.date
source: Date
es: [es] Date

# editor.moodQuestion
source: How are you feeling?
es: [es] How are you feeling?

# editor.tags
source: Tags
es: [es] Tags

# editor.addTag.placeholder
source: Add a tag
es: [es] Add a tag

# editor.journalEntry
source: Journal Entry
es: [es] Journal Entry

# editor.journalEntry.placeholder
source: Start writing your thoughts here...
es: [es] Start writing your thoughts here...

# editor.discardAlert.title
source: Discard Changes?
es: [es] Discard Changes?

# editor.discardAlert.message
source: Are you sure you want to discard your changes?
es: [es] Are you sure you want to discard your changes?

# editor.discardAlert.discard
source: Discard
es: [es] Discard

# editor.discardAlert.keepEditing
source: Keep Editing
es: [es] Keep Editing

# general.add
source: Add
es: [es] Add

# onboarding.welcome.title
source: Welcome to Reflect
es: [es] Welcome to Reflect

# onboarding.welcome.description
source: Your personal journaling companion for mindfulness and self-reflection.
es: [es] Your personal journaling companion for mindfulness and self-reflection.

# onboarding.getStarted.button
source: Get Started
es: [es] Get Started

# onboarding.personalization.title
source: Personalize Your Experience
es: [es] Personalize Your Experience

# onboarding.personalization.subtitle
source: Let's make Reflect yours. Tell us a bit about yourself and your journaling goals.
es: [es] Let's make Reflect yours. Tell us a bit about yourself and your journaling goals.

# onboarding.personalization.name.label
source: Your Name
es: [es] Your Name

# onboarding.personalization.name.placeholder
source: Enter your name
es: [es] Enter your name

# onboarding.personalization.goals.label
source: Journaling Goals
es: [es] Journaling Goals

# onboarding.personalization.goals.description
source: What would you like to achieve with journaling?
es: [es] What would you like to achieve with journaling?

# onboarding.notifications.title
source: Reminder Setup
es: [es] Reminder Setup

# onboarding.notifications.subtitle
source: Never miss a journaling session with daily reminders.
es: [es] Never miss a journaling session with daily reminders.

# onboarding.notifications.enable.toggle
source: Enable Daily Reminders
es: [es] Enable Daily Reminders

# onboarding.notifications.time.label
source: Reminder Time
es: [es] Reminder Time

# onboarding.complete.title
source: You're All Set!
es: [es] You're All Set!

# onboarding.complete.subtitle
source: Your Reflect journal is ready for your thoughts, feelings, and reflections.
es: [es] Your Reflect journal is ready for your thoughts, feelings, and reflections.

# onboarding.complete.button
source: Start Journaling
es: [es] Start Journaling

# general.continue
source: Continue
es: [es] Continue

# profile.title
source: Profile
es: [es] Profile

# profile.edit.button
source: Edit
es: [es] Edit

# profile.personalInfo.header
source: Personal Information
es: [es] Personal Information

# profile.name.placeholder
source: Your Name
es: [es] Your Name

# profile.email.label
source: Email
es: [es] Email

# profile.goals.header
source: Journaling Goals
es: [es] Journaling Goals

# profile.edit.title
source: Edit Profile
es: [es] Edit Profile

# profile.logout.button
source: Log Out
es: [es] Log Out

# profile.logout.confirm.title
source: Log Out?
es: [es] Log Out?

# profile.logout.confirm.message
source: Are you sure you want to log out?
es: [es] Are you sure you want to log out?

# settings.title
source: Settings
es: [es] Settings

# settings.notifications.header
source: Notifications
es: [es] Notifications

# settings.notifications.enable.toggle
source: Enable Reminders
es: [es] Enable Reminders

# settings.notifications.time.label
source: Reminder Time
es: [es] Reminder Time

# settings.appearance.header
source: Appearance
es: [es] Appearance

# settings.appearance.theme.label
source: Theme
es: [es] Theme

# settings.appearance.theme.system
source: System
es: [es] System

# settings.appearance.theme.light
source: Light
es: [es] Light

# settings.appearance.theme.dark
source: Dark
es: [es] Dark

# settings.security.header
source: Security
es: [es] Security

# settings.security.biometrics.toggle
source: Use Face ID / Touch ID
es: [es] Use Face ID / Touch ID

# settings.legal.header
source: Legal
es: [es] Legal

# settings.legal.privacyPolicy
source: Privacy Policy
es: [es] Privacy Policy

# settings.legal.termsOfService
source: Terms of Service
es: [es] Terms of Service

# settings.account.header
source: Account
es: [es] Account

# settings.account.delete.button
source: Delete Account
es: [es] Delete Account

# settings.account.delete.confirm.title
source: Delete Account?
es: [es] Delete Account?

# settings.account.delete.confirm.message
source: This action is irreversible. All your journal entries and data will be permanently deleted.
es: [es] This action is irreversible. All your journal entries and data will be permanently deleted.

# mood.happy
source: Happy
es: [es] Happy

# mood.content
source: Content
es: [es] Content

# mood.neutral
source: Neutral
es: [es] Neutral

# mood.sad
source: Sad
es: [es] Sad

# mood.anxious
source: Anxious
es: [es] Anxious

# mood.angry
source: Angry
es: [es] Angry

# app.name
source: Reflect
es: [es] Reflect
